TexasInstruments/c2000ware-core-sdk/device_support/f28p65x/common/source/f28p65x_epwm.c
//    //
//    // Alternate mapping for EPWM-16. Uncomment if required. Write 0 to
//    // GPAMUx register before configuring GPAGMux to avoid glitches in Mux.
//    //
//    GpioCtrlRegs.GPAMUX2.bit.GPIO30 = 0;  // Configure GPAMUX to 0 for GPIO30
//    GpioCtrlRegs.GPAMUX2.bit.GPIO31 = 0;  // Configure GPAMUX to 0 for GPIO31
//
//    GpioCtrlRegs.GPAGMUX2.bit.GPIO30 = 3; // Configure GPAGMUx for EPWM16A
//    GpioCtrlRegs.GPAGMUX2.bit.GPIO31 = 3; // Configure GPAGMux for EPWM16B
//
//    GpioCtrlRegs.GPAMUX2.bit.GPIO30 = 1;  // Configure GPAMUx for EPWM16A
//    GpioCtrlRegs.GPAMUX2.bit.GPIO31 = 1;  // Configure GPAMux for EPWM16B

    EDIS;
}

//
// InitEPwm17Gpio - Initialize EPWM17 GPIOs
//
void InitEPwm17Gpio(void)
{
    EALLOW;

    //
    // Disable internal pull-up for the selected output pins for reduced
    // power consumption. Pull-ups can be enabled or disabled by the user.
    // Comment out other unwanted lines.
    //
    GpioCtrlRegs.GPCPUD.bit.GPIO93 = 1; // Disable pull-up on GPIO93 (EPWM17A)
    GpioCtrlRegs.GPCPUD.bit.GPIO94 = 1; // Disable pull-up on GPIO94 (EPWM17B)
    //
    // Configure EPWM-17 pins using GPIO regs. This specifies which of the
    // possible GPIO pins will be EPWM17 functional pins.
    // Comment out other unwanted lines.
    //
    GpioCtrlRegs.GPCMUX2.bit.GPIO93 = 1; // Configure GPIO93 as EPWM17A
    GpioCtrlRegs.GPCMUX2.bit.GPIO94 = 1; // Configure GPIO94 as EPWM17B

    EDIS;
}

//
// InitEPwm18Gpio - Initialize EPWM18 GPIOs
//
void InitEPwm18Gpio(void)
{
    EALLOW;

    //
    // Disable internal pull-up for the selected output pins for reduced
    // power consumption. Pull-ups can be enabled or disabled by the user.
    // Comment out other unwanted lines.
    //
    GpioCtrlRegs.GPCPUD.bit.GPIO95 = 1; // Disable pull-up on GPIO95 (EPWM18A)
    GpioCtrlRegs.GPDPUD.bit.GPIO96 = 1; // Disable pull-up on GPIO96 (EPWM18B)
    //
    // Configure EPWM-18 pins using GPIO regs. This specifies which of the
    // possible GPIO pins will be EPWM18 functional pins.
    // Comment out other unwanted lines.
    //
    GpioCtrlRegs.GPCMUX2.bit.GPIO95 = 1; // Configure GPIO95 as EPWM18A
    GpioCtrlRegs.GPDMUX1.bit.GPIO96 = 1; // Configure GPIO96 as EPWM18B

    EDIS;
}
//
// End of File
//
